app/controllers/vendors_controller.rb

SELECT "vendors".* FROM "vendors"
---
  def index
    @vendors = Vendor.all

INSERT INTO "vendors" ("vendor_id", "name", "address", "contact_no", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["vendor_id", "215"], ["name", "12"], ["address", "35"], ["contact_no", "3"], ["created_at", "2016-04-21 16:38:16.135185"], ["updated_at", "2016-04-21 16:38:16.135185"]]
---
  def create
    @vendor = Vendor.new(vendor_params)
    if @vendor.save

SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @vendor = Vendor.find(params[:id])

SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @vendor = Vendor.find(params[:id])

SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "vendors" SET "name" = ?, "address" = ?, "contact_no" = ?, "updated_at" = ? WHERE "vendors"."id" = ?  [["name", "SPEED TRAVELS"], ["address", "YAMAPURI"], ["contact_no", "00000000"], ["updated_at", "2016-04-25 06:28:33.660958"], ["id", 1]]
---
  def update
    @vendor = Vendor.find(params[:id])
    if @vendor.update(vendor_params)

SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "vendors" WHERE "vendors"."id" = ?  [["id", 3]]
---
  def destroy
    @vendor = Vendor.find(params[:id])
    @vendor.destroy